arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/ftm/fsl_ftm_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_ftm_driver.h"
#include "fsl_clock_manager.h"
#include <stdint.h>
#include <stdbool.h>
#include "fsl_device_registers.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! variable holds the calculated period (in timer ticks) for each existing FTM module*/
uint16_t g_FtmModulePeriodTicks[FTM_INSTANCE_COUNT];

/*! variable holds the latest calculated signal measurement (in timer ticks) for each existing FTM module and channel*/
uint16_t g_FtmLatestSigMesurement[FTM_INSTANCE_COUNT][(FSL_FEATURE_FTM_CHANNEL_COUNT >> 1U)];

/*! variable holds the latest value read from the HW (in timer ticks) when a edge was detected*/
uint16_t g_FtmLatestTimeStamp[FTM_INSTANCE_COUNT][FSL_FEATURE_FTM_CHANNEL_COUNT];

/*! variable holds the current operation mode of the input channel*/
ftm_input_op_mode_t g_FtmInputCaptureOpMode[FTM_INSTANCE_COUNT][FSL_FEATURE_FTM_CHANNEL_COUNT];

/*! Stores FTM clock source setting */
static ftm_clock_source_t s_ftmClockSource[FTM_INSTANCE_COUNT];
static uint8_t s_ftmMaxFtmChannel[FTM_INSTANCE_COUNT];
/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_Init
 * Description   : Initializes the FTM driver.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_Init(uint8_t instance, const ftm_user_config_t * info)
{

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint8_t ChIndex;
    /* The reset operation doesn't care about write protection. FTM_HAL_Reset will
     * disable this protection.*/
    FTM_HAL_Reset(ftmBase);
    for(ChIndex = 0; ChIndex < FSL_FEATURE_FTM_CHANNEL_COUNT; ChIndex++)
    {
        g_FtmInputCaptureOpMode[instance][ChIndex] = FTM_NO_OPERATION;
        g_FtmLatestTimeStamp[instance][ChIndex] = 0U;
        if (ChIndex < (FSL_FEATURE_FTM_CHANNEL_COUNT >> 1))
        {
            g_FtmLatestSigMesurement[instance][ChIndex] = 0U;
        }
    }
    s_ftmMaxFtmChannel[instance] = 0U;
    g_FtmModulePeriodTicks[instance] = 0U;
    FTM_HAL_Init(ftmBase, info->ftmPrescaler);
    /* Configure sync for between registers and buffers */
    FTM_DRV_SetSync(instance, info->syncMethod);
    FTM_HAL_SetBdmMode(ftmBase, info->BDMMode);
    /* Timer overflow flag will be activated only when FTM clock
     * is different by "no clock source". This is a hardware behaviour.
     */
    /* Enable/disable timer overflow interrupt */
    FTM_HAL_SetTimerOverflowInt(ftmBase, info->isTofIsrEnabled);
    /* Configure clock source for FTM counter */
    FTM_HAL_SetClockPs(ftmBase, info->ftmPrescaler);
    s_ftmClockSource[instance] = info->ftmClockSource;
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_Deinit
 * Description   : Shuts down the FTM driver.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_Deinit(uint8_t instance)
{

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    FTM_HAL_Reset(ftmBase);
    return FTM_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_CounterStart
 * Description   : Starts the FTM counter. This function provides access to the
 * FTM counter settings. The counter can be run in Up counting or Up-down counting modes.
 * To run the counter in Free running mode, choose Up counting option and provide
 * 0x0 for the countStartVal and 0xFFFF for countFinalVal. Please call this
 * function only when FTM is used as timer/counter.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_CounterStart(uint8_t instance, ftm_timer_param_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint32_t channel = 0U;
    /* Disable counter clock */
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    /* Clear the overflow flag */
    FTM_HAL_ClearTimerOverflow(ftmBase);
    /* Set counter initial and max values */
    FTM_HAL_SetCounterInitVal(ftmBase, timer.initialValue);
    FTM_HAL_SetMod(ftmBase, timer.finalValue);
    /* Use FTM as counter, disable all the channels */
    for (channel = 0U; channel < FSL_FEATURE_FTM_CHANNEL_COUNT; channel++)
    {
        FTM_HAL_SetChnEdgeLevel(ftmBase, channel, 0U);
    }
    if ( timer.mode == FTM_MODE_UP_TIMER)
    {
        FTM_HAL_SetQuadDecoderCmd(ftmBase, 0U);
        FTM_HAL_SetCpwms(ftmBase, 0U);
    }
    else if (timer.mode == FTM_MODE_UP_DOWN_TIMER)
    {
        FTM_HAL_SetQuadDecoderCmd(ftmBase, 0U);
        FTM_HAL_SetCpwms(ftmBase, 1U);
    }
    else
    {
        /* Do nothing*/
    }
    /* Activate interrupts if required */
    FTM_HAL_SetClockSource(ftmBase, s_ftmClockSource[instance]);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_CounterStop
 * Description   : Stops the FTM counter.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_CounterStop(uint8_t instance)
{
    FTM_Type *ftmBase = g_ftmBase[instance];
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    /* Stop the FTM counter */
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_CounterRead
 * Description   : Reads back the current value of the FTM counter.
 *
 *END**************************************************************************/
uint32_t FTM_DRV_CounterRead(uint8_t instance)
{
    FTM_Type *ftmBase = g_ftmBase[instance];
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    return FTM_HAL_GetCounter(ftmBase);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_DeinitPwm
 * Description   : Stops all PWM channels.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_DeinitPwm(uint8_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint8_t channel;
    /* Stop the FTM counter */
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    for (channel=0; channel<s_ftmMaxFtmChannel[instance]; channel++)
    {
        /* Disable PWM mode in hw*/
        FTM_HAL_DisablePwmMode(ftmBase, channel);
    }
    /* Clear fault control register */
    FTM_HAL_ClearFaultControl(ftmBase);
    /* Disable fault interrupt */
    FTM_HAL_SetFaultInt(ftmBase, false);
    /* Disable fault control */
    FTM_HAL_SetFaultControlMode(ftmBase, FTM_FAULT_CONTROL_DISABLED);
    /* Clear out the registers */
    FTM_HAL_SetMod(ftmBase, 0U);
    FTM_HAL_SetCounter(ftmBase, 0U);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_InitPwm
 * Description   : Configures duty cycle and frequency and starts outputting
 * PWM on specified channels .
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_InitPwm(uint8_t instance, const ftm_pwm_param_t * param)
{
    ftm_status_t RetVal = FTM_STATUS_SUCCESS;
    uint8_t channel;
    uint8_t hwChannel;
    uint8_t fltchannel;
    uint8_t chnlPairNum = 0U;
    uint8_t ChannelId = 0U;
    ftm_independent_ch_param_t * independentChannelPtr = (void *)0;
    ftm_combined_ch_param_t * combinedChannelPtr = (void*)0;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    /* Disable counter clock */
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);

    /* Clear the overflow flag */
    FTM_HAL_ClearTimerOverflow(ftmBase);
    /* Disable write protection */
    FTM_HAL_SetWriteProtectionCmd(ftmBase, false);

