arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/ftm/fsl_ftm_driver.c
    /* Configure independent PWM channels */
    for (channel = 0U; channel < param->nNumIndependentPwmChannels ; channel++)
    {
        independentChannelPtr = &(*param->pwmIndependentChannelConfig)[channel];
        ChannelId = independentChannelPtr->hwChannelId;
        chnlPairNum =  FTM_HAL_GetChnPairIndex(ChannelId);
        FTM_HAL_SetDualEdgeCaptureCmd(ftmBase, chnlPairNum, false);
        /* Set ELSB bit and clear ELSA bit*/
        FTM_HAL_SetChnEdgeLevel(ftmBase, ChannelId, 2U);
        /* Set MSB and MSA bits*/
        FTM_HAL_SetChnMSnBAMode(ftmBase, ChannelId, 3U);
        /* Write FTMn_PWMLOAD register to enable synchronized loading points for the given channel */
        FTM_HAL_EnablePwmChannelOutputs(ftmBase, ChannelId);
        FTM_HAL_SetChnOutputPolarityCmd(ftmBase, ChannelId, independentChannelPtr->polarity);
        FTM_HAL_SetDualChnFaultCmd(ftmBase, chnlPairNum, ((param->faultConfig)->faultMode != FTM_FAULT_CONTROL_DISABLED)? true : false);
        /* Enable sync control for channels*/
        FTM_HAL_SetDualChnPwmSyncCmd(ftmBase, chnlPairNum, true);
        FTM_HAL_SetDualChnCombineCmd(ftmBase, chnlPairNum, false);
    }
    /* Configure combined PWM channels */
    for (channel = 0; channel < param->nNumCombinedPwmChannels ; channel++)
    {
        combinedChannelPtr = &(*param->pwmCombinedChannelConfig)[channel];
        ChannelId = combinedChannelPtr->hwChannelId;
        chnlPairNum =  FTM_HAL_GetChnPairIndex(ChannelId);
        FTM_HAL_SetDualEdgeCaptureCmd(ftmBase, chnlPairNum, false);
        /* Set ELSB bit and clear ELSA bit*/
        FTM_HAL_SetChnEdgeLevel(ftmBase, ChannelId, 2U);
        /* Set MSB and MSA bits*/
        FTM_HAL_SetChnMSnBAMode(ftmBase, ChannelId, 3U);
        /* Write FTMn_PWMLOAD register to enable synchronized loading points for the given channel */
        /* Enable channel (n) output */
        FTM_HAL_EnablePwmChannelOutputs(ftmBase, ChannelId);
        /* Enable channel (n+1) output */
        if (combinedChannelPtr->enableSecondChannelOutput)
        {
            FTM_HAL_EnablePwmChannelOutputs(ftmBase,ChannelId + 1U);
            /* When ELSB =0 and ELSA = o for channel (n+1) output is not available */
            FTM_HAL_SetChnEdgeLevel(ftmBase, ChannelId+1U, 2U);
            /* Configure complementary mode for channel (n+1) */
            FTM_HAL_SetDualChnCompCmd(ftmBase,chnlPairNum, combinedChannelPtr->secondChannelPolarity);
        }
        else
            FTM_HAL_DisablePwmChannelOutputs(ftmBase,ChannelId + 1U);
        FTM_HAL_SetChnOutputPolarityCmd(ftmBase, ChannelId, combinedChannelPtr->mainChannelPolarity);
        FTM_HAL_SetDualChnFaultCmd(ftmBase, chnlPairNum, ((param->faultConfig)->faultMode != FTM_FAULT_CONTROL_DISABLED)? true : false);
        /* Enable sync control for channels*/
        FTM_HAL_SetDualChnPwmSyncCmd(ftmBase, chnlPairNum, true);
        FTM_HAL_SetDualChnCombineCmd(ftmBase, chnlPairNum, true);
        /* Configure dead time */
        FTM_HAL_SetDualChnDeadtimeCmd(ftmBase, chnlPairNum, combinedChannelPtr->deadTime);
    }
    /* Set enable outputs to be set to Init/default value*/
    FTM_HAL_SetInitChnOutputCmd(ftmBase, true);
    /* Enable faults (if faults were configured)*/
    if((param->faultConfig)->faultMode != FTM_FAULT_CONTROL_DISABLED )
    {
        /* Configure PWM Output behavior*/
        FTM_HAL_SetPwmFaultBehavior(ftmBase, ((param->faultConfig)->pwmOutputStateOnFault==true)?1U:0U);
        /* Configure fault filter value*/
        FTM_HAL_SetFaultInputFilterVal(ftmBase, ((param->faultConfig)->faultFilterValue));
        for(fltchannel=0; fltchannel < FTM_FEATURE_FAULT_CHANNELS; fltchannel++)
        {
            if(true == (param->faultConfig)->ftmFaultChannelParam[fltchannel].faultChannelEnabled)
            {
                /* Enable fault channel*/
                FTM_HAL_SetFaultInputCmd(ftmBase,fltchannel, true);
                /* Configure fault filter*/
                FTM_HAL_SetFaultInputFilterCmd(ftmBase, fltchannel, ((param->faultConfig)->ftmFaultChannelParam[fltchannel].faultFilterEnabled==true? 1U : 0U));
                /* Configure fault outputs*/
                FTM_HAL_SetChnFaultInputPolarityCmd(ftmBase, fltchannel, (param->faultConfig)->ftmFaultChannelParam[fltchannel].ftmFaultPinPolarity);
            }
        }
        /* Set fault interrupt*/
        if (true == ((param->faultConfig)->pwmFaultInterrupt))
        {
            FTM_HAL_SetFaultInt(ftmBase, true);
        }
        /* Enable fault control*/
        FTM_HAL_SetFaultControlMode(ftmBase, (param->faultConfig)->faultMode);
    }

    /* Configure PWM mode: edge or center aligned */
    FTM_HAL_SetCpwms(ftmBase, (param->Mode == FTM_MODE_CEN_ALIGNED_PWM)? true : false);
    /* Calculate frequency of the give FTM hw module - all channels will run at the same
         frequency */
    g_FtmModulePeriodTicks[instance] = FTM_DRV_ConvertFreqToPeriodTicks(instance, param->uFrequencyHZ);
    /* Based on Ref manual, in PWM mode CNTIN is to be set 0*/
    FTM_HAL_SetCounterInitVal(ftmBase, 0U);
    /* Write Mod register with the value of the period */
    /* For center aligned mode MOD register should be divided by 2 */
    /* For edge aligned mode period is determined by: MOD-CNTIN+1 */
    if (param->Mode == FTM_MODE_CEN_ALIGNED_PWM)
        FTM_HAL_SetMod(ftmBase, g_FtmModulePeriodTicks[instance]>>1U);
    else
        FTM_HAL_SetMod(ftmBase, g_FtmModulePeriodTicks[instance]-1U);
    for (channel=0U; channel < param->nNumIndependentPwmChannels; channel++)
    {
        independentChannelPtr = &(*param->pwmIndependentChannelConfig)[channel];
        hwChannel =  independentChannelPtr->hwChannelId;
        /* Write CnV registers and setup duty cycle and phase values*/
        FTM_DRV_UpdatePwmChannel(instance, hwChannel , independentChannelPtr->uDutyCyclePercent,  0U, false);
    }

    for (channel=0U; channel < param->nNumCombinedPwmChannels; channel++)
    {
        combinedChannelPtr = &(*param->pwmCombinedChannelConfig)[channel];
        hwChannel =  combinedChannelPtr->hwChannelId;
        /* Write CnV registers and setup duty cycle and phase values*/
        FTM_DRV_UpdatePwmChannel(instance, hwChannel , combinedChannelPtr->firstEdge,  combinedChannelPtr->secondEdge, false);
    }
    /* Configure dead time for combine mode */
    FTM_HAL_SetDeadtimeCount(ftmBase, param->deadTimeValue);
    FTM_HAL_SetDeadtimePrescale(ftmBase, param->deadTimePrescaler);
    FTM_HAL_Enable(ftmBase,true);
    FTM_HAL_SetPwmSyncMode(ftmBase,true);
    /* Set clock source to start counter */
    FTM_HAL_SetClockSource(ftmBase, s_ftmClockSource[instance]);
    return RetVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_UpdatePwmChannel
 * Description   : This function converts the input parameters representing
 * frequency in Hz to a period value in ticks needed by the hw timer. Period is
 * calculated depending on the operating mode of the FMT module and is stored in
 * global variable: g_FtmModulePeriodTicks[]. firstEdge and secondEdge can have value between
 * 0 - FTM_MAX_DUTY_CYCLE(0 = 0% duty  and FTM_MAX_DUTY_CYCLE = 100% duty). secondEdge value is used only when
 * FTM module is used in PWM combine mode.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_UpdatePwmChannel(uint8_t instance, uint8_t channel, uint16_t firstEdge, uint16_t secondEdge, bool softwareTrigger)
{

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
    DEV_ASSERT(firstEdge < FTM_MAX_DUTY_CYCLE);
    DEV_ASSERT(channel<FSL_FEATURE_FTM_CHANNEL_COUNT)
    DEV_ASSERT(secondEdge < FTM_MAX_DUTY_CYCLE);
#endif
    uint16_t hwFirstEdge = 0U;
    uint16_t hwSecondEdge = 0U;
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint8_t chnlPairNum = 0;
    /* Calculate DutyCycle based of the previously calculated frequency*/
    /*for greater resolution the DutyCycle values are in the range [0. FTM_MAX_DUTY_CYCLE]
    where 0 = 0% or PWM always at Low and FTM_MAX_DUTY_CYCLE = 100% or PWM always HIGH;
    a value of 0x4000 is equivalent of 50% DutyCycle.  */
    hwFirstEdge = (g_FtmModulePeriodTicks[instance] * firstEdge) >> FTM_DUTY_TO_TICKS_SHIFT;
    hwSecondEdge = (g_FtmModulePeriodTicks[instance] * secondEdge) >> FTM_DUTY_TO_TICKS_SHIFT;
    /*adjust DutyCycle if 100% value is to be achieved.*/
    if(FTM_MAX_DUTY_CYCLE == firstEdge)
    {
        /* If expected duty is 100% then increase by 1 the value that is to be written
       to Hw so it will exceed value of period*/
        hwFirstEdge = hwFirstEdge + 1U;
    }
    chnlPairNum =  FTM_HAL_GetChnPairIndex(channel);
    /* Write LDOK bit to enable transfer between registers and their buffers*/
    FTM_HAL_SetPwmLoadCmd(ftmBase, true);

    if (true == FTM_HAL_GetDualChnCombine(ftmBase, chnlPairNum))
    {
        FTM_HAL_SetChnCountVal(ftmBase, chnlPairNum * 2U,  hwFirstEdge);
        FTM_HAL_SetChnCountVal(ftmBase, chnlPairNum * 2U+1U,  hwSecondEdge);
        FTM_HAL_SetSoftwareTriggerCmd(ftmBase, true);
    }
    else
    {
        /* Channel value is divided by 2 for up down counter mode to keep same duty*/
        if (FTM_HAL_GetCpwms(ftmBase) ==  1U)
            FTM_HAL_SetChnCountVal(ftmBase, channel, hwFirstEdge>>1);
        else
            FTM_HAL_SetChnCountVal(ftmBase, channel, hwFirstEdge);
    }
    /* Software trigger is generated to change CnV regs*/
    /* Before this please configure sync mechanism to use software trigger*/
    if (softwareTrigger)
        FTM_HAL_SetSoftwareTriggerCmd(ftmBase, true);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_SetSync
 * Description   : This function configure the synchronization for PWM register ( CnV, MOD, CINT, HCR, OUTMASK).
 * If this function is used whit wrong parameters it's possible to generate wrong waveform. Registers
 * synchronization need to be configured for PWM and output compare mode.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_SetSync(uint8_t instance, ftm_pwm_sync_t param)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    /* Software and hardware triggers are not allowed in the same time */
    if (param.softwareSync & (param.hardwareSync0 | param.hardwareSync1 | param.hardwareSync2 ))
        return FTM_STATUS_ERROR;
    /* Enhanced PWM sync is used */
    FTM_HAL_SetPwmSyncModeCmd(ftmBase, true);

    /* Configure trigger source for sync */
    FTM_HAL_SetHardwareSyncTriggerSrc(ftmBase, 0U, param.hardwareSync0);
    FTM_HAL_SetHardwareSyncTriggerSrc(ftmBase, 1U, param.hardwareSync1);
    FTM_HAL_SetHardwareSyncTriggerSrc(ftmBase, 2U, param.hardwareSync2);

    /* Configure loading points */
    FTM_HAL_SetMaxLoadingCmd(ftmBase, param.maxLoadingPoint);
    FTM_HAL_SetMinLoadingCmd(ftmBase, param.minLoadingPoint);

    /* Configure sync for OUTMASK register */
    FTM_HAL_SetOutmaskPwmSyncModeCmd(ftmBase, param.outRegSync);
    FTM_HAL_SetOutmaskHardwareSyncModeCmd(ftmBase, param.hardwareSync0 | param.hardwareSync1 | param.hardwareSync2);
    FTM_HAL_SetOutmaskSoftwareSyncModeCmd(ftmBase, param.softwareSync);

    /* Configure sync for INVCTRL register */
    FTM_HAL_SetInvctrlPwmSyncModeCmd(ftmBase, param.inverterSync);
    FTM_HAL_SetInvctrlHardwareSyncModeCmd(ftmBase, (param.hardwareSync0 | param.hardwareSync0 | param.hardwareSync2));
    FTM_HAL_SetInvctrlSoftwareSyncModeCmd(ftmBase, param.softwareSync);

    /* Configure sync for SWOCTRL register */
    FTM_HAL_SetSwoctrlPwmSyncModeCmd(ftmBase, param.inverterSync);
    FTM_HAL_SetSwoctrlHardwareSyncModeCmd(ftmBase, param.hardwareSync0 | param.hardwareSync1 | param.hardwareSync2);
    FTM_HAL_SetSwoctrlSoftwareSyncModeCmd(ftmBase, param.softwareSync);

    /* Configure sync for MOD, HCR, CNTIN, and CnV registers */
    FTM_HAL_SetModCntinCvHardwareSyncModeCmd(ftmBase, param.hardwareSync0 | param.hardwareSync1 | param.hardwareSync2);
    FTM_HAL_SetModCntinCvSoftwareSyncModeCmd(ftmBase, param.softwareSync);
    FTM_HAL_SetCntinPwmSyncModeCmd(ftmBase, param.initCounterSync);

    /* Configure synchronization method (waiting next loading point or now) */
    FTM_HAL_SetCounterSoftwareSyncModeCmd(ftmBase, param.softwareSync & param.syncPoint);
    FTM_HAL_SetCounterHardwareSyncModeCmd(ftmBase, param.syncPoint & (param.hardwareSync0 | param.hardwareSync1 | param.hardwareSync2));

    /* Configure if FTM clears TRIGj (j=0,1,2) when the hardware trigger j is detected. */
    FTM_HAL_SetHwTriggerSyncModeCmd(ftmBase, param.autoClearTrigger);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_InitOutputCompare
 * Description   : Configures the FTM to generate timed pulses
 * When the FTM counter matches the value of compareVal argument (this is
 * written into CnV reg), the channel output is changed based on what is specified
 * in the compareMode argument.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_InitOutputCompare(uint8_t instance, const ftm_output_cmp_param_t *param)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    ftm_output_cmp_ch_param_t * channelPtr = (void *)0;
    uint32_t channel = 0U;
    uint32_t HwChannel = 0U;
    uint8_t chnlPairNum;
    chnlPairNum = FTM_HAL_GetChnPairIndex(HwChannel);
    channelPtr = &(*param->outputChannelConfig)[channel];
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    FTM_HAL_SetCpwms(ftmBase, 0U);
    FTM_HAL_SetDualChnCombineCmd(ftmBase, chnlPairNum, false);
    FTM_HAL_SetDualEdgeCaptureCmd(ftmBase, chnlPairNum, false);
    /* Clear the overflow flag */
    FTM_HAL_ClearTimerOverflow(ftmBase);
    FTM_HAL_SetCounterInitVal(ftmBase, 0U);
    FTM_HAL_SetMod(ftmBase, param->maxCountValue);
    FTM_HAL_SetCounter(ftmBase, 0U);
    FTM_HAL_SetQuadDecoderCmd(ftmBase, false);
    /* Use FTM as counter, disable all the channels */
    for (channel = 0U; channel < param->nNumOutputChannels ; channel++)
    {
        channelPtr = &(*param->outputChannelConfig)[channel];
        HwChannel = channelPtr->hwChannelId;
        /* Set Channel Output mode*/
        FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel, (uint32_t)(channelPtr->ChMode));
        /* Enter counter mode for all configured channels*/
        FTM_HAL_SetChnMSnBAMode(ftmBase, HwChannel, 1U);
        /* Write initial count value for all channels */
        FTM_HAL_SetChnCountVal(ftmBase, HwChannel, channelPtr->comparedValue);
        /* Enable channel output*/
        FTM_HAL_EnablePwmChannelOutputs(ftmBase, HwChannel);
    }
    /* Set software trigger */
    FTM_HAL_SetSoftwareTriggerCmd(ftmBase, true);
    /* Set clock source to start the counter */
    FTM_HAL_SetClockSource(ftmBase, s_ftmClockSource[instance]);
    return FTM_STATUS_SUCCESS;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_DeinitOutputCompare
 * Description   : Disables compare match output control and clears FTM timer configuration
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_DeinitOutputCompare(uint8_t instance, const ftm_output_cmp_param_t *param)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    ftm_output_cmp_ch_param_t * channelPtr = (void *)0;
    uint32_t channel = 0U;
    uint32_t HwChannel = 0U;
    /* Stop the FTM counter */
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    /* Clear the overflow flag */
    FTM_HAL_ClearTimerOverflow(ftmBase);
    FTM_HAL_SetCounterInitVal(ftmBase, 0U);
    for (channel = 0U; channel < param->nNumOutputChannels ; channel++)
    {
        channelPtr = &(*param->outputChannelConfig)[channel];
        HwChannel = channelPtr->hwChannelId;
        /* Disable Channel Output mode*/
        FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel, (uint32_t)0U);
        /* Write initial count value for all channels to 0xFFFF */
        FTM_HAL_SetChnCountVal(ftmBase, HwChannel, 0U);
    }

    /* Disable channel output*/
    FTM_HAL_DisablePwmChannelOutputs(ftmBase, HwChannel);
    /* Clear out the registers */
    FTM_HAL_SetMod(ftmBase, 0U);
    FTM_HAL_SetCounter(ftmBase, 0U);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_UpdateOutputCompareChannel
 * Description   : Sets the next compare match value on the given channel starting
 *                 from the current counter value.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_UpdateOutputCompareChannel(uint8_t instance, uint8_t channel, uint16_t NextComparematchValue, bool softwareTrigger)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    uint32_t u32CounterValue = FTM_HAL_GetCounter(g_ftmBase[instance]);
    uint32_t u32CompareValue = 0U;
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint32_t maxCounterValue = FTM_HAL_GetMod(g_ftmBase[instance]);
        /* Configure channel compare register */
    if ((uint32_t)(u32CounterValue + NextComparematchValue) > maxCounterValue)
    {
        u32CompareValue = (uint32_t)(NextComparematchValue - (maxCounterValue - u32CounterValue));
    }
    else
    {
        u32CompareValue = (uint32_t)(u32CounterValue + NextComparematchValue);
    }
    /* Set CnV value and use software trigger for sync */
    FTM_HAL_SetChnCountVal(g_ftmBase[instance], channel, u32CompareValue);
    FTM_HAL_SetSoftwareTriggerCmd(g_ftmBase[instance], true);
    if (softwareTrigger)
        FTM_HAL_SetSoftwareTriggerCmd(ftmBase, true);
    return FTM_STATUS_SUCCESS;
}

