arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/ftm/fsl_ftm_driver.c
/*FUNCTION*********************************************************************************
 *
 * Function Name : FTM_DRV_InitInputCapture
 * Description   : Configures Channel Input Capture for either getting time-stamps on edge detection
 * or on signal measurement . When the edge specified in the captureMode
 * argument occurs on the channel the FTM counter is captured into the CnV register.
 * The user will have to read the CnV register separately to get this value. The filter
 * function is disabled if the filterVal argument passed in is 0. The filter function
 * is available only on channels 0,1,2,3.
 *
 *END**************************************************************************************/
ftm_status_t FTM_DRV_InitInputCapture(uint8_t instance, const ftm_input_param_t * param)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif

    FTM_Type *ftmBase = g_ftmBase[instance];
    const ftm_input_ch_param_t * channelPtr = (void *)0;
    uint8_t chnlPairNum;
    uint8_t channel = 0U;
    uint8_t HwChannel = 0U;
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    FTM_HAL_SetCounterInitVal(ftmBase, 0U);
    FTM_HAL_SetMod(ftmBase, param->nMaxCountValue);
    FTM_HAL_SetCpwms(ftmBase, 0U);
    s_ftmMaxFtmChannel[instance] = param->nNumChannels;
    for (channel=0U; channel<s_ftmMaxFtmChannel[instance]; channel++)
    {
        channelPtr = &(*param->inputChConfig)[channel];
        HwChannel = channelPtr->hwChannelId;
        chnlPairNum = FTM_HAL_GetChnPairIndex(HwChannel);
        /* Enable filtering for input channels*/
        if (HwChannel < CHAN4_IDX)
        {
            if (true == channelPtr->FilterEn)
            {
                FTM_HAL_SetChnInputCaptureFilter(ftmBase, HwChannel, channelPtr->FilterValue);
            }
            else
            {
                FTM_HAL_SetChnInputCaptureFilter(ftmBase, HwChannel, 0U);
            }
        }
        g_FtmInputCaptureOpMode[instance][channel] = channelPtr->InputMode;
        if (FTM_EDGE_DETECT == g_FtmInputCaptureOpMode[instance][channel])
        {
            FTM_HAL_SetDualChnCombineCmd(ftmBase, chnlPairNum, false);
            FTM_HAL_SetDualEdgeCaptureCmd(ftmBase, chnlPairNum, false);
            /* Set input capture mode*/
            FTM_HAL_SetChnMSnBAMode(ftmBase, HwChannel, 0U);
            if((channelPtr->EdgeAlignement == FTM_RISING_EDGE) || (channelPtr->EdgeAlignement == FTM_FALLING_EDGE) || (channelPtr->EdgeAlignement == FTM_BOTH_EDGES))
            {
                FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel, (uint8_t)channelPtr->EdgeAlignement);
                /*TODO Enable interrupt on channel (n)*/
            }
            else
            {
#ifdef DEV_ERROR_DETECT
                DEV_ASSERT((channelPtr->EdgeAlignement == FTM_RISING_EDGE) || (channelPtr->EdgeAlignement == FTM_FALLING_EDGE) || (channelPtr->EdgeAlignement == FTM_BOTH_EDGES));
#endif
            }
        }
        else if (FTM_SIGNAL_MEASUREMENT == g_FtmInputCaptureOpMode[instance][channel])
        {
            FTM_HAL_SetDualChnCombineCmd(ftmBase, chnlPairNum, false);
            FTM_HAL_SetDualEdgeCaptureCmd(ftmBase, chnlPairNum, true);
            /* Enable dual edge input capture */
            FTM_HAL_SetDualChnDecapCmd(ftmBase,  chnlPairNum, true);
            /* If continuous mode is set*/
            if(true == channelPtr->ContinuousModeEn)
            {
                /* Set MSnA and MSnB bit*/
                FTM_HAL_SetChnMSnBAMode(ftmBase, HwChannel, 3U);
            }
            else
            {
                /* Clear MSnA and Set MSnB bit*/
                FTM_HAL_SetChnMSnBAMode(ftmBase, HwChannel, 2U);
            }
            /*TODO  Enable interrupt on channel (n) and (n+1)*/
            if(FTM_DUTY_MEASUREMENT == channelPtr->MeasurementType)
            {
                /* Measure time between rising and falling edge - positive duty*/
                FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel, FTM_RISING_EDGE);
                FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel+1U, FTM_FALLING_EDGE);
            }
            else if(FTM_PERIOD_MEASUREMENT == channelPtr->MeasurementType)
            {
                /* If channel (n) is configured to capture rising edges (ELS(n)B:ELS(n)A = 0:1) than channel (n+1) is setup to capture also raising edges (ELS(n+1)B:ELS(n+1)A = 0:1),*/
                /* Alternatively if channel (n) is configured to capture falling edges (ELS(n)B:ELS(n)A = 1:0) then channel (n+1) also captures falling edges (ELS(n+1)B:ELS(n+1)A = 1:0),*/
                FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel, FTM_RISING_EDGE);
                FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel+1U, FTM_RISING_EDGE);
            }
            else
            {
                /* Do nothing */
            }
        }
    }
    /* Set clock source to start the counter */
    FTM_HAL_SetClockSource(ftmBase, s_ftmClockSource[instance]);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION*********************************************************************************
 *
 * Function Name : FTM_DRV_DeinitInputCapture
 * Description   : Disables Channel Input Capture
 *
 *END**************************************************************************************/
ftm_status_t FTM_DRV_DeinitInputCapture(uint8_t instance, const ftm_input_param_t * param)
{
#ifdef DEV_ERROR_DETECT
    DEV_DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    const ftm_input_ch_param_t * channelPtr = (void *)0;
    uint8_t chnlPairNum;
    uint8_t channel = 0U;
    uint8_t HwChannel = 0U;
    /* FTM counter is disabled */
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    FTM_HAL_SetCounterInitVal(ftmBase, 0U);
    FTM_HAL_SetMod(ftmBase, 0xFFFFU);
    FTM_HAL_SetCpwms(ftmBase, 0U);
    s_ftmMaxFtmChannel[instance] = param->nNumChannels;
    for (channel=0U; channel<s_ftmMaxFtmChannel[instance]; channel++)
    {
        channelPtr = &(*param->inputChConfig)[channel];
        HwChannel = channelPtr->hwChannelId;
        chnlPairNum = FTM_HAL_GetChnPairIndex(HwChannel);
        /* Disable filtering for input channels*/
        if (HwChannel < CHAN4_IDX)
        {
            FTM_HAL_SetChnInputCaptureFilter(ftmBase, HwChannel, 0U);
        }
        FTM_HAL_SetDualChnCombineCmd(ftmBase, chnlPairNum, false);
        FTM_HAL_SetDualEdgeCaptureCmd(ftmBase, chnlPairNum, false);
        FTM_HAL_SetChnEdgeLevel(ftmBase, HwChannel, (uint8_t)0U);
        FTM_HAL_DisableChnInt(ftmBase, HwChannel);
    }
    return FTM_STATUS_SUCCESS;
}

