arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/ftm/fsl_ftm_driver.c
/*FUNCTION*********************************************************************************
 *
 * Function Name : FTM_DRV_GetInputCaptureMeasurement
 * Description   : This function is used to calculate the measurement and/or time stamps values
 * which are read from the C(n, n+1)V registers and stored to the static buffers.
 *
 *END**************************************************************************************/
uint16_t FTM_DRV_GetInputCaptureMeasurement(uint8_t instance, uint8_t channel)
{
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint8_t chnlPairNum;
    uint16_t first_event_time;
    uint16_t second_event_time;
    if(FTM_SIGNAL_MEASUREMENT == g_FtmInputCaptureOpMode[instance][channel])
    {
        /* Measurement for signal measurement (dual edge input capture) */
        chnlPairNum = FTM_HAL_GetChnPairIndex(channel);
        /* clear channels event flags */
        FTM_HAL_HasChnEventOccurred(ftmBase, channel+1U);
        FTM_HAL_HasChnEventOccurred(ftmBase, channel);
        FTM_HAL_ClearChnEventFlag(ftmBase, channel+1U);
        FTM_HAL_ClearChnEventFlag(ftmBase, channel);
        /* Wait while measurement is done */
        while (FTM_HAL_HasChnEventOccurred(ftmBase, channel + 1U) != true){}
        /* Get time stamp for each edge */
        first_event_time = FTM_HAL_GetChnCountVal(ftmBase, channel);
        second_event_time = FTM_HAL_GetChnCountVal(ftmBase, channel + 1U);
        if (second_event_time < first_event_time)
        {
            /* Measurement when overflow occurred */
            g_FtmLatestSigMesurement[instance][chnlPairNum] = second_event_time + (FTM_HAL_GetMod(ftmBase) - first_event_time);
            /* Clear flags for channels n and n+1 */
        }
        else
        {
            /* Measurement when overflow doesn't occurred */
            g_FtmLatestSigMesurement[instance][chnlPairNum] = second_event_time - first_event_time;
            /* Clear flags for channels n and n+1 */
        }
        return (g_FtmLatestSigMesurement[instance][chnlPairNum]);
    }
    else
    {
        FTM_HAL_HasChnEventOccurred(ftmBase, channel);
        FTM_HAL_ClearChnEventFlag(ftmBase, channel);
        /* Measurement for edge detect (single edge input capture) */
        /* Wait while measurement is done */
        while (FTM_HAL_HasChnEventOccurred(ftmBase, channel) != true){}
        /* Save time stamp */
        g_FtmLatestTimeStamp[instance][channel] = (uint16_t)(FTM_HAL_GetChnCountVal(ftmBase, channel));
        return (g_FtmLatestTimeStamp[instance][channel]);
    }
}
/*FUNCTION*********************************************************************************

 * Function Name : FTM_DRV_StartNewSignalMeasurement
 * Description   : This function starts new Signal Measurements on a dual input compare channel
 * that is configured as single-shot measurement.
 *
 *END**************************************************************************************/
ftm_status_t FTM_DRV_StartNewSignalMeasurement(uint8_t instance, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    /* Clear CH(n)F and CH(n+1)F  flags and Set DECAP bit */
    FTM_Type *ftmBase = g_ftmBase[instance];
    uint8_t chnlPairNum;
    /* Get channel mode*/
    if(FTM_FEATURE_INPUT_CAPTURE_SINGLE_SHOT == FTM_HAL_GetChnMode(ftmBase, channel))
    {
        if(FTM_SIGNAL_MEASUREMENT == g_FtmInputCaptureOpMode[instance][channel])
        {
            chnlPairNum = FTM_HAL_GetChnPairIndex(channel);
            /* Clear event flags for channel n and n + 1*/
            FTM_HAL_ClearChnEventFlag(ftmBase, (channel + 1U));
            FTM_HAL_ClearChnEventFlag(ftmBase, channel);
            /* Set DECAP bit to start measurement*/
            FTM_HAL_SetDualChnDecapCmd(ftmBase,  chnlPairNum, true);
        }
        else
        {
#ifdef DEV_ERROR_DETECT
            DEV_ASSERT(FTM_SIGNAL_MEASUREMENT == g_FtmInputCaptureOpMode[instance][channel]);
#endif
        }
    }
    else
    {
#ifdef DEV_ERROR_DETECT
        DEV_ASSERT(FTM_FEATURE_INPUT_CAPTURE_SINGLE_SHOT == FTM_HAL_GetChnMode(ftmBase, channel));
#endif
    }
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_QuadDecodeStart
 * Description   : Configures the parameters needed and activates quadrature
 * decode mode.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_QuadDecodeStart(uint8_t instance, ftm_quad_decode_config_t config)
{

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    /* Disable Quadrature Decoder */
    FTM_HAL_SetQuadDecoderCmd(ftmBase, false);
    FTM_HAL_SetClockSource(ftmBase, FTM_CLOCK_SOURCE_NONE);
    /* Configure Quadrature Decoder */
    /* Set decoder mode Speed and direction or Phase A and Phase B encoding */
    FTM_HAL_SetQuadMode(ftmBase, config.mode);
    /* Set filter state for Phase A (enable/disable) */
    FTM_HAL_SetQuadPhaseAFilterCmd(ftmBase, config.phase_a_config.kFtmPhaseInputFilter);
    /* Set Phase A filter value if phase filter is enabled */
    if (config.phase_a_config.kFtmPhaseInputFilter)
    {
        FTM_HAL_SetChnInputCaptureFilter(ftmBase, CHAN0_IDX, config.phase_a_config.kFtmPhaseFilterVal);
    }
    /* Set filter state for Phase B (enable/disable) */
    FTM_HAL_SetQuadPhaseBFilterCmd(ftmBase, config.phase_b_config.kFtmPhaseInputFilter);
    /* Set Phase B filter value if phase filter is enabled */
    if (config.phase_b_config.kFtmPhaseInputFilter)
    {
        FTM_HAL_SetChnInputCaptureFilter(ftmBase,  CHAN1_IDX, config.phase_b_config.kFtmPhaseFilterVal);
    }
    /* Set polarity for Phase A and Phase B */
    FTM_HAL_SetQuadPhaseAPolarity(ftmBase, config.phase_a_config.kFtmPhasePolarity);
    FTM_HAL_SetQuadPhaseBPolarity(ftmBase, config.phase_b_config.kFtmPhasePolarity);
    /* Configure counter (initial value and max value) */
    FTM_HAL_SetCounterInitVal(ftmBase, config.initial_val);
    FTM_HAL_SetMod(ftmBase, config.max_val);
    FTM_HAL_SetCounter(ftmBase, config.initial_val);
    /* Enable Quadrature Decoder */
    FTM_HAL_SetQuadDecoderCmd(ftmBase, true);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_QuadDecodeStop
 * Description   : De-activates quadrature decoder mode.
 *
 *END**************************************************************************/
ftm_status_t FTM_DRV_QuadDecodeStop(uint8_t instance)
{
    FTM_Type *ftmBase = g_ftmBase[instance];
    /* Disable Quadrature decoder */
    FTM_HAL_SetQuadDecoderCmd(ftmBase, false);
    return FTM_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_QuadGetState
 * Description   : Return the current quadrature decoder state
 * (counter value, overflow flag and overflow direction)
 *
 *END**************************************************************************/
ftm_quad_decoder_state_t FTM_DRV_QuadGetState(uint8_t instance)

{
    FTM_Type *ftmBase = g_ftmBase[instance];
    ftm_quad_decoder_state_t state;
    state.overflow_direction = FTM_HAL_GetQuadTimerOverflowDir(ftmBase);
    state.overflow_flag = FTM_HAL_HasTimerOverflowed(ftmBase);
    state.counter = FTM_HAL_GetCounter(ftmBase);
    return state;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_GetFrequency
 * Description   : Retrieves the frequency of the clock source feeding the FTM counter.
 * Function will return a 0 if no clock source is selected and the FTM counter is disabled.
 * The returned value is
 *END**************************************************************************/
uint32_t FTM_DRV_GetFrequency(uint8_t instance)
{

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    FTM_Type *ftmBase = g_ftmBase[instance];
    const clock_names_t FixedClockName[FTM_INSTANCE_COUNT] = {SIM_FTM0_CLOCKSEL, SIM_FTM1_CLOCKSEL, SIM_FTM2_CLOCKSEL, SIM_FTM3_CLOCKSEL};
    uint8_t clkPs;
    uint32_t freq = 0U;
    clkPs = (1 << FTM_HAL_GetClockPs(ftmBase));
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
#endif
    switch(s_ftmClockSource[instance])
    {
    case FTM_CLOCK_SOURCE_EXTERNALCLK:
        (void)CLOCK_SYS_GetFreq(FixedClockName[instance],  &freq);
        break;
    case FTM_CLOCK_SOURCE_FIXEDCLK:
        (void) CLOCK_SYS_GetFreq(SIM_CLK32K_CLOCK,  &freq);
        break;
    case FTM_CLOCK_SOURCE_SYSTEMCLK:
        (void) CLOCK_SYS_GetFreq(PLATFORM_CLOCK, &freq);
        break;
    default:
        break;
    }
    return (uint32_t)(freq/clkPs);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FTM_DRV_ConvertFreqToPeriodTicks
 * Description   : This function converts the input parameters representing
 * frequency in Hz to a period value in ticks needed by the hw timer.
 *
 *END**************************************************************************/
uint16_t FTM_DRV_ConvertFreqToPeriodTicks(uint8_t instance, uint32_t freqencyHz)
{
    uint32_t uFTMhz;
    uFTMhz = FTM_DRV_GetFrequency(instance);
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FTM_INSTANCE_COUNT);
    DEV_ASSERT(freqencyHz = 0U);
#endif
    return (uint16_t)(uFTMhz / freqencyHz);
}
/*******************************************************************************
 * EOF
 ******************************************************************************/

